## Plan Result (aat_global)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["tax-tribunals-datacapture"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/tax-tribunals-datacapture"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["tax-tribunals-datacapture"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/taxtribunalsdatacaptureaat"
      ~ mode                              = "Detection" -> "Prevention"
        name                              = "taxtribunalsdatacaptureaat"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (5 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_tax-tribunals-datacapture_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utma"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmb"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmc"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmz"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1730,"Program":"tfcmt","SHA1":"","Target":"aat_global","Vars":{}} -->